{
  "locale": "en",
  "year": "y",
  "month": "m",
  "openapi-mobile-client": {
    "download": "Download",
    "descriptionTitle": "Description",
    "description": "The OpenAPI Mobile Client is the mobile application which helps user to easily perform HTTP requests using their mobile devices."
  },
  "drag-and-score": {
    "description": {
      "title": "Description",
      "content": "Drag and Score is a time killer. Try to reach your maximum score by passing interesting and hard levels. Be careful - ball may fall out of a basket.\n\nFeatures:\n\t- 49 interesting and hard levels;\n\t- easy to learn how to play;\n\t- cool physics of the ball;\n\t- 2 types of game (linear and random). You should open levels by passing them in linear mode so that you can easily play on this levels in random mode, where levels are going in random way.\n\t- 5 chapters, where each one has it's own new feature, for example: moving platforms, portals and ...(play to find out:)."
    }
  },
  "about-me": {
    "overview": {
      "title": "Overview",
      "description": "My passion for coding was born in school where I began writing some simple applications using Delphi. Later during my university period I've got acquainted with more advanced programming languages, such as C++, Kotlin, Java, JavaScript, Python and the most important (at least for me) - C#.\n\nNow I am a full stack software developer. During my work experience I've used different kinds of languages and toolsets. For instance at the first job I was using Xamaring framework for developing a cross-platform chat bot. Than I used C# and ASP NET MVC for writing BE logic and JavaScript with Jquery plugin for FE part. Also I've used Unity for implementing a new feature for the existing game and developing a brand new AR application from scratch. Today in my work I am using C# (ASP.NET Core) and TypeScript (Angular 8).\n\nI like to learn new technologies. I have a quite good experience with Unity Engine so that I even created a mobile game called \"Drag and Score\" which you can find in Google Play Store. Also during my free time I've managed to learn Flutter framework and its main language - Dart. As a result of my studying I've developed a cross-platform mobile application for automating a process of creating HTTP API requests from clients to the server."
    },
    "skills": {
      "title": "Skills",
      "languages": "Languages",
      "databases": "Databases",
      "frameworks": "Frameworks",
      "libraries": "Libraries"
    },
    "work-experiences": {
      "title": "Work Experience",
      "data-art": {
        "description": "Working with the project which is written using Ruby on Rails framework. Integrating this project to the main system which is based on .NET technologies.\nUsing the following technologies: Ruby on Rails, Sidekiq, RSpec, React, ASP.NET Core, PostgreSQL, T-SQL, MongoDB.\nOn this project I communicate with clients a lot (even more than on my previous project) since they are a part of our dev team.",
        "location": "Kyiv/Remote",
        "company": "DataArt",
        "position": "Full Stack Software Developer"
      },
      "redwerk": {
        "description": "Participating in creating a new WEB application based on microservices. For creating a back-end logic using a ASP.NET Core. For creating a front-end logic - Angular 8. Working with Cosmos DB and Docker. Participating in meetings with clients to fully understand requirements.",
        "location": "Kyiv/Remote",
        "company": "Redwerk",
        "position": "Full Stack Software Developer"
      },
      "pnn-soft": {
        "description": "Maintained existing monolith WEB application, created using framework ASP NET MVC. Writing code for back-end part using C# language as well as for front-end part using a JavaScript and JQuery library. Because I have a good knowledge of Unity I also participated in two different projects where we used this engine. The first one was a runner game. Here I developed a new level by writing a new functionality and placing 3d models in a scene as a game designer. In the second project I developed a simple Augmented Reality mobile application using Unity Foundation.",
        "location": "Kyiv",
        "company": "PNN-Soft",
        "position": "Full Stack Software Developer"
      },
      "freelance": {
        "description": "Developed a simple chat bot using Xamarin framework.",
        "location": "Kyiv",
        "company": "Freelance",
        "position": "Xamarin Developer"
      }
    },
    "educations": {
      "title": "Education",
      "kpi": {
        "university": "National Technical University of Ukraine \"Igor Sikorsky Kyiv Polytechnic Institute\"",
        "specialization": "Software Engineering",
        "degree": "Master",
        "description": "As a result of my studying in a university I have created a mobile application using cross-platform framework Flutter. This application is similar to a Swagger but for mobile platforms. It simplify the process of creating and sending HTTP API requests from clients to the servers."
      }
    }
  }
}