{
  "locale": "uk",
  "year": "р",
  "month": "м",
  "openapi-mobile-client": {
    "download": "Завантажити",
    "descriptionTitle": "Опис",
    "description": "Кекіч"
  },
  "drag-and-score": {
    "description": {
      "title": "Опис",
      "content": "Drag and Score - це, так званий, тайм-кіллер. Спробуй досягти свого максимального балу, проходячи цікаві і складні рівні. Будь обережний - м'яч може випасти з корзини.\n\nОсобливості:\n\t- 49 цікавих і складних рівнів;\n\t- легко навчитись грати;\n\t- крута фізика м'яча;\n\t- 2 типи гри (лінійний і рандомний).Тобі слід відкривати рівні, проходячи їх в лінійному режимі, щоб вони були стали доступними в рандомному режимі, де рівні, як слідує з назви, генеруються в довільному порядку.\n\t- 5 частин, де кожна має свою унікальну особливість, наприклад: рухомі платформи, портали і ...(зіграй, щоб дізнатись:)."
    }
  },
  "about-me": {
    "overview": {
      "title": "Опис",
      "description": "Моя любов до програмування зародилась ще в шкільні часи, коли я познайомився з Delphi. Пізніше, протягом мого навчання в університеті я познайомився з більш досконалими мовами програмування, такими як C++, Kotlin, Java, JavaScript, Python та найважливішою (принаймні для мене) - C#.\n\nЗараз я працюю як фулстек розробик програмного забезпечення. Впродовж моїх робочих років я використовував різні види мов програмування та набори інструментів для роботи з ними. Наприклад, на першій роботі було залучено фреймворк Xamarin для розробки крос-платформеного чат-бота. На наступному проєкті я використовував C# та ASP NET MVC для написання бек-енд логіки та JavaScript із плагіном Jquery для фронтенд частини. Окрім того я застосовував Unity як для власних проєктів так і для комерційних проєктів замовників. Так на одному з проктів доводилось створювати новий рівень для гри типу ранера, а також створювати абсолютно новий додаток AR з нуля. Сьогодні у своїй роботі я використовую C # (ASP.NET Core) та TypeScript (Angular 8), а також Ruby. \n\nЯ люблю вивчати нові технології. У мене досить хороший досвід роботи з Unity Engine. Я навіть створив мобільну гру під назвою \"Drag and Score \", яку ви можете знайти в Google Play Store. Також у вільний час я зумів вивчити фреймворк Flutter і його основну мову - Dart. В результаті я розробив крос-платформeний мобільний додаток для автоматизації процесу створення запитів HTTP API від клієнтів до сервера."    },
    "skills": {
      "title": "Вміння",
      "languages": "Мови програмування",
      "databases": "Бази даних",
      "frameworks": "Фреймворки",
      "libraries": "Бібліотеки"
    },
    "work-experiences": {
      "title": "Досвід роботи",
      "data-art": {
        "description": "Беру участь в підтримці проєкту, що написаний на Ruby on Rails. Окрім того проводжу інтеграцію даного проєкту до загальної системи, яка базується на технологіях сімейства .NET.\nСеред стеку технологій є наступні: Ruby on Rails, Sidekiq, RSpec, React, ASP.NET Core, PostgreSQL, T-SQL, MongoDB.\nНа даному проєкті доводиться (навіть частіше ніж на попередньому) спілкуватись з клієнтами.",
        "location": "Київ/Віддалено",
        "company": "DataArt",
        "position": "Фулстек-розробник"
      },
      "redwerk": {
        "description": "Розробляв новий WEB-застосунок, що базувався на архітектурі мікросервісів. Був задіяний в написанні бекенду, де головним фреймворком виступав ASP.NET Core, а також фронтенду - Angular 8. До роботи на даному проєкті я не мав ні досвіду ні знань з Angular. Проте на практиці довелось зіштовхнутись з даним рушієм і в результаті я отримав непогані вміння у роботі з цим фрейморком. У якості бази даних у нас виступала нереляційна Azure Cosmos DB. Для зручної роботи з мікросервісами ми вироситовували Docker. На даному проєкті для кращого розуміння вимог та побажань клієнтів, доводилось брати участь у регулярних мітингах з ними. Це дозволило значно прокращити розмовний рівень англійської мови. ",
        "location": "Київ/Віддалено",
        "company": "Redwerk",
        "position": "Фулстек-розробник"
      },
      "pnn-soft": {
        "description": "Підтримував створений WEB-застосунок у вигляді моноліту. Веб-сайт був створений за допомогою фреймоворку ASP NET MVC. В мої обов'язки входило написання коду для бекенд частини (C#), а також для фронтенду, на стороні якого був чистий JavaScript з бібліотекою JQuery.\n\nОскільки я маю досить непогані знання і досвід у використанні Unity, я також брав участь у розробці двох програмних забезпечень, де ми використовували даний рушій. Перший проєкт представляв собою мобільну гру для платформи IOS в жанрі раннера. Мені потрібно було створити цілком новий рівень. Тут я виступав у ролі розробника, гейм-дизайнера, адже мені доводилось самому розміщувати ігрові об'єкти на сцені таким чином, щоб гра виглядала не тільки красиво, але і? щоб не було зруйновано баланс, а також тестера.\n\nДругий проєкт вже не був грою. Натомість він представляв з себе застосунок, основною технологією якого було використання функцій Augmented Reality Для цього мені доводилось провести дослідження, щоб знайти оптимальний фреймоворк для роботи з AR. Даний проєкт я зробив, використовуючи фреймворк Unity Foundation.",
        "location": "Київ",
        "company": "PNN-Soft",
        "position": "Фулстек-розробник"
      },
      "freelance": {
        "description": "Розробляв простий чат-бот, використовуючи фреймворк Xamarin.",
        "location": "Київ",
        "company": "Фріланс",
        "position": "Xamarin розробник"
      }
    },
    "educations": {
      "title": "Освіта",
      "kpi": {
        "university": "Національний технічний університет України \"Київський політехнічний інститут імені Ігоря Сікорського\"",
        "specialization": "Інженерія програмного забезпечення",
        "degree": "Магістр",
        "description": "В результаті мого навчання в університеті я створив мобільний додаток, використовуючи крос-платформений фреймоворк Flutter. Даний додаток є схожим по функціоналу до Swagger, але для мобільних платформ. Це спрощує процес створення і надсилання HTTP API запитів від клієнтів до серверів."
      }
    }
  }
}