{
  "locale": "uk",
  "year": "р",
  "month": "м",
  "languages": {
    "en": "Англійська",
    "uk": "Українська"
  },
  "themes": {
    "light": "Світла",
    "dark": "Темна"
  },
  "menu": {
    "about-me": "Про мене",
    "drag-and-score": "Drag And Score",
    "openapi-mobile-client": "OpenAPI Mobile Client",
    "draw-on-time": "Draw On Time",
    "settings": {
      "title": "Налаштування",
      "language": "Мова",
      "theme": "Тема"
    }
  },
  "openapi-mobile-client": {
    "download": "Завантажити",
    "technologies": {
      "title": "Технології"
    },
    "description": {
      "title": "Опис",
      "content": "Даний застосунок дозволяє зручно та швидко виконувати HTTP запити з мобільних девайсів до серверів, що підтримують інтерфейс OpenAPI. OpenAPI створює програмну документацію, яку даний додаток використовує для побудови графічного інтерфейсу. Задавши адресу серверу, користувач має змогу побачити структуру API даного сервісу, а саме: його контроллери, методи, параметри даних методів, при чому в залежності від типу параметра відповідний графічний елемент буде відображений. Так для тексту - це текстове поле, для дати - календар, тощо. Для виконання запиту необхідно просто вибрати потрібний метод, ввести дані у потрібні поля, та натиснути кнопку відправлення повідомлення. При цьому виконається валідація введених даних і в разі відсутності помилок, повідомлення буде відправлено.\n\nКлючові особливості:\n\t- побудова графічного інтерфейсу на основі метаданих;\n\t- валідація введених даних;\n\t- задання токена авторизації;\n\t- виконання HTTP/HTTPS запиту.\n\nОсновні переваги:\n\t- користувач має повну інформацію про структуру API;\n\t- значно складніше помилитись при створенні запиту;\n\t- збільшення продуктивності при роботі з API з мобільних платформ;\n\t- значно зручніший у користуванні ніж аналоги."
    }
  },
  "drag-and-score": {
    "download": "Завантажити",
    "play-online": "Грати онлайн",
    "technologies": {
      "title": "Технології"
    },
    "description": {
      "title": "Опис",
      "content": "Drag and Score - це, так званий, тайм-кіллер. Спробуй досягти свого максимального балу, проходячи цікаві і складні рівні. Будь обережний - м'яч може випасти з корзини.\n\nОсобливості:\n\t- 49 цікавих і складних рівнів;\n\t- легко навчитись грати;\n\t- крута фізика м'яча;\n\t- 2 типи гри (лінійний і рандомний).Тобі слід відкривати рівні, проходячи їх в лінійному режимі, щоб вони були стали доступними в рандомному режимі, де рівні, як слідує з назви, генеруються в довільному порядку.\n\t- 5 частин, де кожна має свою унікальну особливість, наприклад: рухомі платформи, портали і ...(зіграй, щоб дізнатись:)."
    }
  },
  "draw-on-time": {
    "play": "Грати",
    "technologies": {
      "title": "Технології"
    },
    "description": {
      "title": "Опис",
      "content": "В цій грі вам необхідно спробувати намалювати малюнок, базуючись на наявному. При цьому ви повинні це зробити настільки точно як це тільки можливо з обмеженим часом. Вам це під силу?"
    }
  },
  "about-me": {
    "overview": {
      "title": "Опис",
      "description": "Моя любов до програмування зародилась ще в шкільні часи, коли я пробував створювати невеличкі програми за допомогою Pascal, Delphi. Пізніше, протягом мого навчання в університеті я познайомився з іншими мовами програмування, такими як C++, Kotlin, Java, JavaScript, Python, C#, Ruby.\n\nЗараз я працюю як фулстек розробик програмного забезпечення. Впродовж моїх робочих років я використовував різні види мов програмування та набори інструментів для роботи з ними. Наприклад, на першій роботі було залучено фреймворк Xamarin для розробки крос-платформеного чат-бота. На наступному проєкті я використовував C# та ASP NET MVC для написання бек-енд логіки та JavaScript із бібліотекою Jquery для фронтенд частини. Окрім того я застосовував Unity як для власних так і для комерційних проєктів. Так на одному з них доводилось створювати новий рівень для гри жанру \"раннер\", а також створювати абсолютно новий додаток AR з нуля. Сьогодні у своїй роботі я використовую C# (ASP.NET Core), TypeScript (Angular 8), а також Ruby.\n\nЯ люблю вивчати нові технології. У мене досить хороший досвід роботи з Unity. Я навіть створив мобільну гру під назвою \"Drag and Score \", яку ви можете знайти в Google Play Store. Також у вільний час я зумів вивчити фреймворк Flutter і його основну мову - Dart. В результаті я розробив крос-платформeний мобільний додаток для автоматизації процесу створення запитів HTTP API від клієнтів до сервера."
    },
    "skills": {
      "title": "Вміння",
      "languages": "Мови програмування",
      "databases": "Бази даних",
      "frameworks": "Фреймворки",
      "libraries": "Бібліотеки"
    },
    "work-experiences": {
      "title": "Досвід роботи",
      "amazon": {
        "description": "",
        "location": "Барселона",
        "company": "Amazon",
        "position": "Інженер з розробки програмного забезпечення"
      },
      "data-art": {
        "description": "Беру участь в підтримці проєкту, що написаний на Ruby on Rails. Окрім того проводжу інтеграцію даного проєкту до загальної системи, яка базується на технологіях сімейства .NET.\nСеред стеку технологій є наступні: Ruby on Rails, Sidekiq, RSpec, React, ASP.NET Core, PostgreSQL, T-SQL, MongoDB.\nНа даному проєкті доводиться (навіть частіше ніж на попередньому) спілкуватись з клієнтами.",
        "location": "Київ/Віддалено",
        "company": "DataArt",
        "position": "Фулстек-розробник"
      },
      "redwerk": {
        "description": "Розробляв новий WEB-застосунок, що базувався на архітектурі мікросервісів. Був задіяний в написанні бекенду, де головним фреймворком виступав ASP.NET Core, а також фронтенду - Angular 8. До роботи на даному проєкті я не мав ні досвіду ні знань з Angular. Проте на практиці довелось зіштовхнутись з даним рушієм і в результаті я отримав непогані вміння у роботі з цим фрейморком. У якості бази даних у нас виступала нереляційна Azure Cosmos DB. Для зручної роботи з мікросервісами ми вироситовували Docker. На даному проєкті для кращого розуміння вимог та побажань клієнтів, доводилось брати участь у регулярних мітингах з ними. Це дозволило значно прокращити розмовний рівень англійської мови. ",
        "location": "Київ/Віддалено",
        "company": "Redwerk",
        "position": "Фулстек-розробник"
      },
      "pnn-soft": {
        "description": "Підтримував створений WEB-застосунок у вигляді моноліту. Веб-сайт був створений за допомогою фреймоворку ASP NET MVC. В мої обов'язки входило написання коду для бекенд частини (C#), а також для фронтенду, на стороні якого був чистий JavaScript з бібліотекою JQuery.\n\nОскільки я маю досить непогані знання і досвід у використанні Unity, я також брав участь у розробці двох програмних забезпечень, де ми використовували даний рушій. Перший проєкт представляв собою мобільну гру для платформи IOS в жанрі раннера. Мені потрібно було створити цілком новий рівень. Тут я виступав у ролі розробника, гейм-дизайнера, адже мені доводилось самому розміщувати ігрові об'єкти на сцені таким чином, щоб гра виглядала не тільки красиво, але і? щоб не було зруйновано баланс, а також тестера.\n\nДругий проєкт вже не був грою. Натомість він представляв з себе застосунок, основною технологією якого було використання функцій Augmented Reality Для цього мені доводилось провести дослідження, щоб знайти оптимальний фреймоворк для роботи з AR. Даний проєкт я зробив, використовуючи фреймворк Unity Foundation.",
        "location": "Київ",
        "company": "PNN-Soft",
        "position": "Фулстек-розробник"
      },
      "freelance": {
        "description": "Розробляв невеличкий мобільний чат-бот, де користувач мав можливість ввести певну команду і отримати необхідну відповідь від сервера. Для створення даного застосунку використовував фреймфорк Xamarin, а для деплою - AppCenter. Для спілкування з сервером було використано технологію long polling. Дана робота надала мені необхідні знання та практичні навички в комерційній розробці застосунків, що взаємодіють з вебом.",
        "location": "Київ",
        "company": "Фріланс",
        "position": "Xamarin розробник"
      }
    },
    "educations": {
      "title": "Освіта",
      "kpi": {
        "university": "Національний технічний університет України \"Київський політехнічний інститут імені Ігоря Сікорського\"",
        "specialization": "Інженерія програмного забезпечення",
        "degree": "Магістр",
        "description": "Один з кращих технічних університетів України. Навчання тут дозволило мені отримати як теоретичні так і практичні навички в різних сферах прорамування (геймдев, машинне навчаня, ВЕБ-розробка, технології опрацювання великих даних, тощо). В процесі освоєння тієї чи іншої технології було створено чимало програм. Однією з найвизначніших серед них є \"OpenAPI Mobile Client\", яка стала моєю дипломною роботою бакалаврської програми."
      }
    }
  }
}